package com.rustam.dev.tinkoff.solutioncup.tasks;

/*
Фильтр коллекции

Необходимо отфильтровать одну числовую коллекцию по другой.

Требуется реализовать метод, получающий на вход две коллекции.
Первая коллекция — это та, которую нужно фильтровать.
Вторая коллекция — это коллекция-«фильтр».

В итоге необходимо вернуть результат, содержащий только те элементы
из первой коллекции, которые присутствуют во второй коллекции.
При этом порядок элементов результата не важен.

Ограничения:
- Любая из коллекций может быть пустой;
- Коллекции состоят из целых чисел;
- Необходимо учесть возможные повторения чисел.

Пример

Входные данные:
1) [3, 5, 4, 5, 4]
2) [5, 4]

Выходные данные:
[5, 4, 5, 4]
(порядок не важен)

Задача: реализовать метод filterOneCollectionByAnother так, чтобы он
возвращал новую коллекцию, содержащую только те элементы первой коллекции,
которые есть во второй коллекции.
*/

import java.util.List;

public class _07_Filter {

    public List<Integer> filterOneCollectionByAnother(List<Integer> firstCollection,
                                                      List<Integer> secondCollection) {
        // пожалуйста, добавьте свой код здесь

        return null;
    }
}
