package com.rustam.dev.tinkoff.solutioncup.tasks;

/*
Камуфляж и шпионаж

Необходимо написать функцию, которая декодирует и расшифровывает строку.

Ограничения:
- Функция должна принимать на вход строку;
- Функция должна возвращать строку.

Пример

Входные параметры:
РҐРѕРєС€С‚ СЂСЏРѕРЅРµРіР° Р±, Ps С‘Р±С€СЊС‡С‡s. СЋС‚РѕС‘СЂР±s С‘СЃР±.

Выходные параметры:
Хакер пишет, а чайник плачет.

Подсказка (пример отображаемых соответствий):
о – к – н – а

Задача: реализовать декодирование строки по заданному принципу.
В методе main строка считывается из стандартного ввода, затем должна быть
расшифрована, и результат необходимо вывести в System.out.
*/

import java.util.*;
import java.lang.*;

class _03_Camouflage {
    public static void main(String args[]) {
        var scanner = new Scanner(System.in);
        var input = scanner.nextLine();

        // декодируйте строку
        // TODO: здесь нужно написать код, который преобразует входную строку
        //       в осмысленный текст согласно правилам задачи

        String result = "декодированный текст";

        System.out.println(result);
    }
}
