package com.rustam.dev.tinkoff.solutioncup.tasks;

/*
Сжатие самоизолирующихся последовательностей 🪜

Текст задачи

Необходимо написать функцию, которая будет принимать на вход массив чисел
и отдавать сжатые последовательности в виде массива кортежей.

Ограничения

• Функция должна принимать на вход строку с числами вида:
  1, 2, 2, 3, 4, 3, 3, 3

• Функция должна возвращать массив кортежей с числами.

• Каждый элемент кортежа должен удовлетворять формату:

    (x, y)

  где
  x — число из последовательности;
  y — количество раз, которое это число встречается ПОДРЯД в последовательности.

  То есть числа группируются по непрерывным одинаковым значениям,
  и порядок групп должен сохраняться.

• На выход необходимо отдать строку вида:

  (1, 1), (2, 2), (3, 1), (4, 1), (3, 3)

Пример

Входные параметры:
1, 2, 2, 3, 4, 3, 3, 3

Выходные:
(1, 1), (2, 2), (3, 1), (4, 1), (3, 3)

Задача: реализовать сжатие последовательности (run-length encoding),
сгруппировав подряд идущие одинаковые числа и указав их количество.
Результат нужно вывести в System.out в виде строки с кортежами.
*/

import java.util.*;
import java.lang.*;

class _06_Compression {
    public static void main(String args[]) {
        var scanner = new Scanner(System.in);
        var input = scanner.nextLine();

        // здесь решение
        // TODO: распарсить строку чисел, сгруппировать подряд идущие одинаковые значения
        //       и сформировать строку вида: (x, y), (x, y), ...

        String result = "(1,1)"; // это пример, вычислите свой результат
        System.out.println(result);
    }
}
